2023-9-8/489ffd4a40-STDY.org
#+INCLUDE: "../../prefix.org"

#+TITLE: 学习cpu_hotplug

* cpu_hotplug
1. 一个更加新颖的CPU-hotplug支持使用是在suspend resume support for SMP.

2. 命令行开关：
   - =="maxcpus=n"== 限制启动时cpus数量到n；假如有四个CPUs，使用maxcpus=2,启动时则只会启动两个cpu，启动后可再选择启动其他cpu；
   - =="nr_cpus=n"== 限制kernel支持的CPUs数量；被舍弃的cpu在启动之后也不可再使用；
   - =="additional_cpus=n"== 限制可热插拔的cpus数量："cpu_possible_mask = cpu_present_mask + additional_cpus"
   - =="possible_cpus=n"== 此选项设置"cpu_possible_mask"中的"possible_cpus"比特位；
   - =="cpu0_hotplug"== 允许关闭CPU0；

3. CPU maps：
   - =="cpu_possbile_mask"== 系统中可以使用的CPUs的位图；用来在启动时为CPU分配每cpu变量空间，这些变量不受CPUs的卸载与安装而收缩或生长；
   - =="cpu_online_mask"== 当前在线的CPUs位图；在"__cpu_up()"中设置，如果一个cpu可以被kernel进行调度并准备接收设备中断；"__cpu_disable()"可以将CPU在kernel视角进行下线，但要保证所有OS服务和中断迁移到其他CPU；
   - =="cpu_present_mask"== 当前系统中存在的CPU位图；他们中并非全部在线；当相关子系统进行物理热插拔时，通过事件hot-add/hot-remove处理此bitmap；比bitmap当前还没有固定规则，目前典型的时候是在boot阶段，当禁用热插拔时初始化topology;
   - 这三个位图不需要直接操作，大部分使用都是只需要读取就可以了；当设置每cpu资源时，总是使用 "cpu_possible_mask" 或 "for_each_possbile_cpu()" 来迭代；对于宏 "for_each_cpu()" 可以用来迭代一个自定义的CPU mask；代表CPUs位图时要使用 "cpumask_t" 而不是其他；

4. 使用CPU热插拔：
   - ==CONFIG_HOTPLUG_CPU== 使能此内核选项；
     #+begin_src sh
       ls -lh /sys/devices/system/cpu
     #+end_src
     #+RESULTS:
     | total      | 0 |      |      |      |     |    |       |                 |
     | drwxr-xr-x | 5 | root | root |    0 | Sep |  8 | 11:04 | cpu0            |
     | drwxr-xr-x | 5 | root | root |    0 | Sep |  8 | 11:04 | cpu1            |
     | drwxr-xr-x | 5 | root | root |    0 | Sep |  8 | 11:04 | cpu10           |
     | drwxr-xr-x | 5 | root | root |    0 | Sep |  8 | 11:04 | cpu11           |
     | drwxr-xr-x | 5 | root | root |    0 | Sep |  8 | 11:04 | cpu12           |
     | drwxr-xr-x | 5 | root | root |    0 | Sep |  8 | 11:04 | cpu13           |
     | drwxr-xr-x | 5 | root | root |    0 | Sep |  8 | 11:04 | cpu14           |
     | drwxr-xr-x | 5 | root | root |    0 | Sep |  8 | 11:04 | cpu15           |
     | drwxr-xr-x | 5 | root | root |    0 | Sep |  8 | 11:04 | cpu2            |
     | drwxr-xr-x | 5 | root | root |    0 | Sep |  8 | 11:04 | cpu3            |
     | drwxr-xr-x | 5 | root | root |    0 | Sep |  8 | 11:04 | cpu4            |
     | drwxr-xr-x | 5 | root | root |    0 | Sep |  8 | 11:04 | cpu5            |
     | drwxr-xr-x | 5 | root | root |    0 | Sep |  8 | 11:04 | cpu6            |
     | drwxr-xr-x | 5 | root | root |    0 | Sep |  8 | 11:04 | cpu7            |
     | drwxr-xr-x | 5 | root | root |    0 | Sep |  8 | 11:04 | cpu8            |
     | drwxr-xr-x | 5 | root | root |    0 | Sep |  8 | 11:04 | cpu9            |
     | drwxr-xr-x | 2 | root | root |    0 | Sep |  8 | 11:04 | cpufreq         |
     | drwxr-xr-x | 2 | root | root |    0 | Sep |  8 | 11:04 | cpuidle         |
     | drwxr-xr-x | 2 | root | root |    0 | Sep |  8 | 11:04 | hotplug         |
     | -r--r--r-- | 1 | root | root | 4.0K | Sep |  8 | 11:04 | isolated        |
     | -r--r--r-- | 1 | root | root | 4.0K | Sep |  8 | 11:04 | kernel_max      |
     | -r--r--r-- | 1 | root | root | 4.0K | Sep |  8 | 11:04 | modalias        |
     | -r--r--r-- | 1 | root | root | 4.0K | Sep |  8 | 11:04 | offline         |
     | -r--r--r-- | 1 | root | root | 4.0K | Sep |  8 | 11:04 | online          |
     | -r--r--r-- | 1 | root | root | 4.0K | Aug | 29 | 11:16 | possible        |
     | -r--r--r-- | 1 | root | root | 4.0K | Aug | 29 | 11:16 | present         |
     | drwxr-xr-x | 2 | root | root |    0 | Sep |  8 | 11:04 | smt             |
     | -rw-r--r-- | 1 | root | root | 4.0K | Sep |  8 | 11:04 | uevent          |
     | drwxr-xr-x | 2 | root | root |    0 | Sep |  8 | 11:04 | vulnerabilities |
     1. 文件 offline/online/possible/present 代表CPU mask；
     2. 每一个cpu文件夹包含一个online文件用来控制CPU的逻辑开关 (0/1)
     #+begin_src sh
       echo 0 > /sys/devices/system/cpu/cpu4/online
       smpboot: CPU 4 is now offline
     #+end_src
     1. CPU关机之后，就会从/proc/interrupts和/proc/cpuinfo中移除；
     2. CPU0总是特殊的，并且一般不支持热插拔；

** CPU 热插拔协调(The CPU hotplug coordination)
1. 卸载case：
   - 一旦CPU进行逻辑上的关机，就会调用注册进来的，在状态转换时进行调用的回调函数: CPUHP_ONLINE --> CPUHP_OFFLINE
     1. 如果由于一个suspend操作导致任务冻结，则 "cpuhp_tasks_frozen" 设置为 true；
     2. 所有进行从当前处理器迁移到其他处理器；新处理器从进程的cpuset，也就是进程想要在哪些处理器上运行，上进行选择；
     3. 当前处理器上的所有中断迁移到新处理器上；
     4. 迁移定时器事件；
     5. 所有服务迁移完成后，kernel调用一个架构指定的routine "__cpu_disable()" 来执行架构清理工作；

** CPU热插拔API(THe CPU hotplug API)
*** CPU hotplug state machine
1. CPU从CPUHP_OFFLINE到CPUHP_ONLINE，每个状态都有一个startup/teardown回调函数；
2. 当CPU上线时，各个状态的startup回调函数顺序调用，直到CPUHP_ONLINE；They can also be invoked when the callbacks of a state are set up or an instance is added to a multi-instance state. CPU下线也同理；
3. If a usage site requires only a callback in one direction of the hotplug operations (CPU online or CPU offline) then the other not-required callback can be set to NULL when the state is set up.

4. 有一个词状态空间state space，尝试理解它，它分为三个部分：
   1. The PREPARE section
      - 占据状态空间中：CPUHP_OFFLINE --> CPUHP_BRINGUP_CPU
      - 这个部分下的startup回调函数在CPU online操作之后，真正online之前；
      - 这个部分下的teardow回调函数在CPU offline操作之后，真正失效之前；
      - 这个部分下，这些回调函数都由一个控制CPU调用，因为目标CPU还没起来或已经下线；
      - startup回调允许失败，如果失败，则online终止；CPU会变成之前的状态，通常是CPUHP_OFFLINE.
      - teardown回调不允许失败；
   2. The STARTING section
      - CPUHP_BRINGUP_CPU + 1 --> CPUHP_AP_ONLINE
      - startup/teardown回调函数在目标CPU上运行，目标CPU中断禁止；回调函数不允许失败；
      - 回调函数用来为核心子系统做低级硬件初始化或关机；
   3. The ONLINE section
      - CPUHP_AP_ONLINE + 1 --> CPUHP_ONLINE
      - startup/teardown在目标CPU上调用运行；
      - 回调函数在per CPU hotplug thread上下文调用，这个thread是固定于每个可插拔CPU的；当前中断和抢占都在使能；
      - 回调允许失败，失败后操作终止，回归到原来状态；
