2023-9-8/489ffd4a40-STDY.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 17:05 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>学习cpu_hotplug</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">学习cpu_hotplug</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9518292">1. cpu_hotplug</a>
<ul>
<li><a href="#orgdc851ed">1.1. CPU 热插拔协调(The CPU hotplug coordination)</a></li>
<li><a href="#org005d924">1.2. CPU热插拔API(THe CPU hotplug API)</a></li>
<li><a href="#org9ecd4fc">1.3. Architecture's requirements</a></li>
<li><a href="#orgc817fec">1.4. User Space Notification</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9518292" class="outline-2">
<h2 id="org9518292"><span class="section-number-2">1.</span> cpu_hotplug</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>一个更加新颖的CPU-hotplug支持使用是在suspend resume support for SMP.</li>

<li>命令行开关：
<ul class="org-ul">
<li><code>="maxcpus=n"=</code> 限制启动时cpus数量到n；假如有四个CPUs，使用maxcpus=2,启动时则只会启动两个cpu，启动后可再选择启动其他cpu；</li>
<li><code>="nr_cpus=n"=</code> 限制kernel支持的CPUs数量；被舍弃的cpu在启动之后也不可再使用；</li>
<li><code>="additional_cpus=n"=</code> 限制可热插拔的cpus数量："cpu_possible_mask = cpu_present_mask + additional_cpus"</li>
<li><code>="possible_cpus=n"=</code> 此选项设置"cpu_possible_mask"中的"possible_cpus"比特位；</li>
<li><code>="cpu0_hotplug"=</code> 允许关闭CPU0；</li>
</ul></li>

<li>CPU maps：
<ul class="org-ul">
<li><code>="cpu_possbile_mask"=</code> 系统中可以使用的CPUs的位图；用来在启动时为CPU分配每cpu变量空间，这些变量不受CPUs的卸载与安装而收缩或生长；</li>
<li><code>="cpu_online_mask"=</code> 当前在线的CPUs位图；在"__cpu_up()"中设置，如果一个cpu可以被kernel进行调度并准备接收设备中断；"__cpu_disable()"可以将CPU在kernel视角进行下线，但要保证所有OS服务和中断迁移到其他CPU；</li>
<li><code>="cpu_present_mask"=</code> 当前系统中存在的CPU位图；他们中并非全部在线；当相关子系统进行物理热插拔时，通过事件hot-add/hot-remove处理此bitmap；比bitmap当前还没有固定规则，目前典型的时候是在boot阶段，当禁用热插拔时初始化topology;</li>
<li>这三个位图不需要直接操作，大部分使用都是只需要读取就可以了；当设置每cpu资源时，总是使用 "cpu_possible_mask" 或 "for_each_possbile_cpu()" 来迭代；对于宏 "for_each_cpu()" 可以用来迭代一个自定义的CPU mask；代表CPUs位图时要使用 "cpumask_t" 而不是其他；</li>
</ul></li>

<li>使用CPU热插拔：
<ul class="org-ul">
<li><p>
<code>=CONFIG_HOTPLUG_CPU=</code> 使能此内核选项；
</p>
<div class="org-src-container">
<pre class="src src-sh">       ls -lh /sys/devices/system/cpu
</pre>
</div>
<ol class="org-ol">
<li>文件 offline/online/possible/present 代表CPU mask；</li>
<li>每一个cpu文件夹包含一个online文件用来控制CPU的逻辑开关 (0/1)</li>
</ol>
<div class="org-src-container">
<pre class="src src-sh">       <span style="font-weight: bold;">echo</span> 0 &gt; /sys/devices/system/cpu/cpu4/online
       smpboot: CPU 4 is now offline
</pre>
</div>
<ol class="org-ol">
<li>CPU关机之后，就会从/proc/interrupts和/proc/cpuinfo中移除；</li>
<li>CPU0总是特殊的，并且一般不支持热插拔；</li>
</ol></li>
</ul></li>
</ol>
</div>

<div id="outline-container-orgdc851ed" class="outline-3">
<h3 id="orgdc851ed"><span class="section-number-3">1.1.</span> CPU 热插拔协调(The CPU hotplug coordination)</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>卸载case：
<ul class="org-ul">
<li>一旦CPU进行逻辑上的关机，就会调用注册进来的，在状态转换时进行调用的回调函数: CPUHP_ONLINE --&gt; CPUHP_OFFLINE
<ol class="org-ol">
<li>如果由于一个suspend操作导致任务冻结，则 "cpuhp_tasks_frozen" 设置为 true；</li>
<li>所有进行从当前处理器迁移到其他处理器；新处理器从进程的cpuset，也就是进程想要在哪些处理器上运行，上进行选择；</li>
<li>当前处理器上的所有中断迁移到新处理器上；</li>
<li>迁移定时器事件；</li>
<li>所有服务迁移完成后，kernel调用一个架构指定的routine "__cpu_disable()" 来执行架构清理工作；</li>
</ol></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org005d924" class="outline-3">
<h3 id="org005d924"><span class="section-number-3">1.2.</span> CPU热插拔API(THe CPU hotplug API)</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<ol class="org-ol">
<li><a id="org3fc4ec2"></a>CPU hotplug state machine<br>
<div class="outline-text-4" id="text-1-2-1">
<ol class="org-ol">
<li>CPU从CPUHP_OFFLINE到CPUHP_ONLINE，每个状态都有一个startup/teardown回调函数；</li>
<li>当CPU上线时，各个状态的startup回调函数顺序调用，直到CPUHP_ONLINE；They can also be invoked when the callbacks of a state are set up or an instance is added to a multi-instance state. CPU下线也同理；</li>
<li>If a usage site requires only a callback in one direction of the hotplug operations (CPU online or CPU offline) then the other not-required callback can be set to NULL when the state is set up.</li>

<li>有一个词状态空间state space，尝试理解它，它分为三个部分：
<ol class="org-ol">
<li>The PREPARE section
<ul class="org-ul">
<li>占据状态空间中：CPUHP_OFFLINE --&gt; CPUHP_BRINGUP_CPU</li>
<li>这个部分下的startup回调函数在CPU online操作之后，真正online之前；</li>
<li>这个部分下的teardow回调函数在CPU offline操作之后，真正失效之前；</li>
<li>这个部分下，这些回调函数都由一个控制CPU调用，因为目标CPU还没起来或已经下线；</li>
<li>startup回调允许失败，如果失败，则online终止；CPU会变成之前的状态，通常是CPUHP_OFFLINE.</li>
<li>teardown回调不允许失败；</li>
</ul></li>
<li>The STARTING section
<ul class="org-ul">
<li>CPUHP_BRINGUP_CPU + 1 --&gt; CPUHP_AP_ONLINE</li>
<li>startup/teardown回调函数在目标CPU上运行，目标CPU中断禁止；回调函数不允许失败；</li>
<li>回调函数用来为核心子系统做低级硬件初始化或关机；</li>
</ul></li>
<li>The ONLINE section
<ul class="org-ul">
<li>CPUHP_AP_ONLINE + 1 --&gt; CPUHP_ONLINE</li>
<li>startup/teardown在目标CPU上调用运行；</li>
<li>回调函数在per CPU hotplug thread上下文调用，这个thread是固定于每个可插拔CPU的；当前中断和抢占都在使能；</li>
<li>回调允许失败，失败后操作终止，回归到原来状态；</li>
</ul></li>
</ol></li>
</ol>
</div>
</li>
