2023-9-8/489ffd4a40-STDY.html
<li><a id="org283303f"></a>CPU online/offline operations<br>
<div class="outline-text-4" id="text-1-2-2">
<p>
一个成功的online操作如下：
</p>
<div class="org-src-container">
<pre class="src src-rst">  [CPUHP_OFFLINE]
  [CPUHP_OFFLINE + 1]-&gt;startup()       -&gt; success
  [CPUHP_OFFLINE + 2]-&gt;startup()       -&gt; success
  [CPUHP_OFFLINE + 3]                  -&gt; skipped because startup == NULL
  ...
  [CPUHP_BRINGUP_CPU]-&gt;startup()       -&gt; success
  === End of PREPARE section
  [CPUHP_BRINGUP_CPU + 1]-&gt;startup()   -&gt; success
  ...
  [CPUHP_AP_ONLINE]-&gt;startup()         -&gt; success
  === End of STARTUP section
  [CPUHP_AP_ONLINE + 1]-&gt;startup()     -&gt; success
  ...
  [CPUHP_ONLINE - 1]-&gt;startup()        -&gt; success
  [CPUHP_ONLINE]
</pre>
</div>

<p>
一个成功的offline操作如下：
</p>
<div class="org-src-container">
<pre class="src src-rst">  [CPUHP_ONLINE]
  [CPUHP_ONLINE - 1]-&gt;teardown()       -&gt; success
  ...
  [CPUHP_AP_ONLINE + 1]-&gt;teardown()    -&gt; success
  === Start of STARTUP section
  [CPUHP_AP_ONLINE]-&gt;teardown()        -&gt; success
  ...
  [CPUHP_BRINGUP_ONLINE - 1]-&gt;teardown()
  ...
  === Start of PREPARE section
  [CPUHP_BRINGUP_CPU]-&gt;teardown()
  [CPUHP_OFFLINE + 3]-&gt;teardown()
  [CPUHP_OFFLINE + 2]                  -&gt; skipped because teardown == NULL
  [CPUHP_OFFLINE + 1]-&gt;teardown()
  [CPUHP_OFFLINE]
</pre>
</div>

<p>
一个失败的online操作：
</p>
<div class="org-src-container">
<pre class="src src-rst">  [CPUHP_OFFLINE]
  [CPUHP_OFFLINE + 1]-&gt;startup()       -&gt; success
  [CPUHP_OFFLINE + 2]-&gt;startup()       -&gt; success
  [CPUHP_OFFLINE + 3]                  -&gt; skipped because startup == NULL
  ...
  [CPUHP_BRINGUP_CPU]-&gt;startup()       -&gt; success
  === End of PREPARE section
  [CPUHP_BRINGUP_CPU + 1]-&gt;startup()   -&gt; success
  ...
  [CPUHP_AP_ONLINE]-&gt;startup()         -&gt; success
  === End of STARTUP section
  [CPUHP_AP_ONLINE + 1]-&gt;startup()     -&gt; success
  ---
  [CPUHP_AP_ONLINE + N]-&gt;startup()     -&gt; fail
  [CPUHP_AP_ONLINE + (N - 1)]-&gt;teardown()
  ...
  [CPUHP_AP_ONLINE + 1]-&gt;teardown()
  === Start of STARTUP section
  [CPUHP_AP_ONLINE]-&gt;teardown()
  ...
  [CPUHP_BRINGUP_ONLINE - 1]-&gt;teardown()
  ...
  === Start of PREPARE section
  [CPUHP_BRINGUP_CPU]-&gt;teardown()
  [CPUHP_OFFLINE + 3]-&gt;teardown()
  [CPUHP_OFFLINE + 2]                  -&gt; skipped because teardown == NULL
  [CPUHP_OFFLINE + 1]-&gt;teardown()
  [CPUHP_OFFLINE]
</pre>
</div>

<p>
一个失败的offline操作：
</p>
<div class="org-src-container">
<pre class="src src-rst">  [CPUHP_ONLINE]
  [CPUHP_ONLINE - 1]-&gt;teardown()       -&gt; success
  ...
  [CPUHP_ONLINE - N]-&gt;teardown()       -&gt; fail
  [CPUHP_ONLINE - (N - 1)]-&gt;startup()
  ...
  [CPUHP_ONLINE - 1]-&gt;startup()
  [CPUHP_ONLINE]
</pre>
</div>

<p>
重复失败的话，会停在最后失败的地方；
online过程失败 --&gt; 尝试offline --&gt; offline失败 --&gt; 再次online --&gt; 还是失败 --&gt; endless loop
</p>
</div>
</li>
<li><a id="org37e640e"></a>Allocating a state<br>
<div class="outline-text-4" id="text-1-2-3">
<p>
两种方法：
静态分配
</p>
<ul class="org-ul">
<li>perf core(kernel core)的startup callback需要在perf driver(device driver)的startup callback之前调用；</li>
<li>During a CPU offline operation the driver teardown callbacks have to be invoked before the core teardown callback.</li>
<li>静态分配在 "cpuhp_state" enum中的常量进行描述，可以在 include/linux/cpuhotplug.h中找到；</li>
</ul>
<p>
动态分配
</p>
<ul class="org-ul">
<li>只有PREPARE &amp; ONLINE sections提供有动态分配的范围；</li>
</ul>
</div>
</li>
<li><a id="org75b17da"></a>Setup of a CPU hotplug state<br>
<div class="outline-text-4" id="text-1-2-4">
<p>
热插拔核心提供以下接口：
</p>
<ul class="org-ul">
<li>cpuhp_setup_state(state, name, startup, teardown)</li>
<li>cpuhp_setup_state_nocalls(state, name, startup, teardown)</li>
<li>cpuhp_setup_state_cpuslocked(state, name, startup, teardown)</li>
<li>cpuhp_setup_state_nocalls_cpuslocked(state, name, startup, teardown)</li>
</ul>
<p>
有多个实例instances的驱动或子系统，每个实例都需要在CPU热插拔时进行调用，CPU 热插拔核心提供了多实例支持；与驱动程序特定的实力列表相比，其优势在于，与实例相关的函数完全针对CPU hotplug操作进行序列化，并在添加和删除时提供状态回调的自动调用；
</p>
<ul class="org-ul">
<li>cpuhp_setup_state_multi(state, name, startup, teardown)</li>
</ul>
<p>
@state 参数可以时静态分配的状态，也可以是需要进行动态分配的标识CPUHP_PREPARE_DYN/CPUHP_ONLINE_DYN;
@name  用来给sysfs进行输出；明明约定："sybsys:mode", or "subsys/driver:mode"; 如 "perf:mode" or "perf/x86:mode"； 常见的mode有如下几个：
<code>=======</code> <code>=============================================================================</code>
prepare   For states in the PREPARE section. 如果state是prepare section中的，则这样设置；
dead      For states in the PREPARE section which do not provide a startup callback;
starting  For states in the STARTING section;
dying     For states in the STARTING section which do not provide a startup callback;
online    For states in the ONLINE section;
offline   For states in the ONLINE section which do not provide a startup callback;
<code>=======</code> <code>=============================================================================</code>
因为@name只用来给sysfs做说明，因此，如果有更合适的@name，也可以用来替换上面这些；
@name例子："perf/online", "perf/x86:prepare", "RCU/tree:dying", "sched/waitempty" 
@startup指向一个CPU online操作时，@state状态下的回调函数；必须要则置NULL；
@teardown同理；
</p>

<p>
这些函数在处理注册回调的方式有所不同：
</p>
<ul class="org-ul">
<li>cpuhp_setup_state_nocalls(), cpuhp_setup_state_nocalls_cpuslocked() and cpuhp_setup_state_multi()只安装回调函数；</li>
<li>cpuhp_setup_state() and cuphp_setup_state_cpuslocked() 安装并在所有在线且状态大于当前注册的@state的CPU上调用@startup；取决于state section，callback在PREPARE section时，在当前CPU上调用，ONLINE时，在每个online CPU上都调用(in the context of the CPU's hotplug thread)；</li>
</ul>
<p>
If a callback fails for CPU N then the teardown callback for CPU 0..N-1 is invoked to rollback the operation. The state setup fails, the callbacks for the state are not installed and in case of dynamic allocation the allocated state is freed.
</p>

<p>
The state setup and the callback invocations are serialized against CPU hotplug operations. If the setup function has to be called from a CPU hotplug read locked region, then the _cpuslocked() variants have to be used. These functions cannot be used from within CPU hotplug callbacks.
</p>

<p>
函数返回值：
<code>===</code> <code>==========================================================================</code>
0     静态分配的状态设置成功
&gt;0    动态分配的状态设置成功
      返回值就是分配的状态号；如果状态回调之后不得不需要移除，则需要保存此状态号；
&lt;0    操作失败
<code>===</code> <code>==========================================================================</code>
</p>
</div>
</li>
<li><a id="org840b8d8"></a>Removal of a CPU hotplug state<br>
<div class="outline-text-4" id="text-1-2-5">
<ul class="org-ul">
<li>cpuhp_remove_state(state)</li>
<li>cpuhp_remove_state_nocalls(state)</li>
<li>cpuhp_remove_state_nocalls_cpuslocked(state)</li>
<li>cpuhp_remove_multi_state(state)</li>
</ul>

<p>
cpuhp_remove_state(state) 移除回调函数并在CPU状态大于此状态号的在线上CPUs调用teardown；
</p>

<p>
为了完成移除，teardown不能失败；
</p>
</div>
</li>
<li><a id="org002c2b4"></a>Multi-Instance state instance management<br>
<div class="outline-text-4" id="text-1-2-6">
<p>
Once the multi-instance state is set up, instances can be added to the state:
</p>
<ul class="org-ul">
<li>cpuhp_state_add_instance(state, node)</li>
<li>cpuhp_state_add_instance_nocalls(state, node)</li>
</ul>

<p>
@state 可以是静态分配的状态号，也可以是cpuhp_setup_state_multi()动态分配的；
@node  一个指向hlist_node的指针，hlist_node是嵌在实例数据结构中的一个成员；
       这个指针通过node传递给multi-instance状态回调函数，可以通过它及container_of获取到具体实例的数据结构；
</p>

<p>
两个函数的不同：
cpuhp_state_add_instance_nocalls()只添加实例到multi-instance state's node list;
cpuhp_state_add_instance()不但只添加实例，也调用startup回调函数；再描述一遍，只有CPUs当前的状态比@state大，才会在CPUs上执行；并且，取决于状态所处的section，如果是PREPARE section,则只在当前CPU上调用，如果是ONLINE section，则在每个online CPU的热插拔线程上下文调用；
</p>

<p>
从状态的节点列表上移除实例：
</p>
<ul class="org-ul">
<li>cpuhp_setup_remove_instance(state, node)</li>
<li>cpuhp_setup_remove_instance_nocalls(state, node)</li>
</ul>
<p>
其他同理，不再描述；  
</p>
</div>
</li>
