2023-9-8/489ffd4a40-STDY.org
*** Examples
在STARTING section静态分配并设置startup/teardown函数，以便在online/offline操作时得到通知:
#+begin_src c
  ret = cpuhp_setup_state(CPUHP_SUBSYS_STARTING, "subsys:starting", subsys_cpu_starting, subsys_cpu_dying);
  if(ret < 0)
	return ret;
  ...;
  cpuhp_remove_state(CPUHP_SUBSYS_STARTING);
#+end_src

动态分配并只在offline操作时调用：
#+begin_src c
  state = cpuhp_setup_state(CPUHP_ONLINE_DYN, "subsys:offline", NULL, subsys_cpu_offline);
  if(state < 0)
	return state;
  ...;
  cpuhp_remove_state(state);
#+end_src

ONLINE section + callback on online operations + without invoking:
#+begin_src c
  state = cpuhp_setup_state_nocalls(CPUHP_ONLINE_DYN, "subsys:online", subsys_cpu_online, NULL);
  if(state < 0)
	return state;
  ...;
  cpuhp_remove_state_nocalls(state);
#+end_src

ONLINE section + callback on online/offline operations + multi-instances:
#+begin_src c
  state = cpuhp_setup_state_multi(CPUHP_ONLINE_DYN, "subsys:online", subsys_cpu_online, subsys_cpu_offline); // no callbacks
  if(state < 0)
	return state;
  ...;
  ret = cpuhp_setup_add_instance(state, &inst1->node); // callback
  if(ret)
	return ret;
  ...;
  ret = cpuhp_setup_add_instance(state, &inst2->node); // callback
  if(ret)
	return ret;
  ...;
  cpuhp_remove_instance(state, &inst1->node); // callback
  ...;
  cpuhp_remove_instance(state, &inst2->node); // callback
  ...;
  cpuhp_remove_multi_state(state);
#+end_src
*** Testing of hotplug states
验证一个自定义状态是否工作的一个方法是关闭一个核并重新打开，或者将核置到某个状态，如CPUHP_AP_ONLINE，然后返回到CPUHP_ONLINE; 后者可以模拟CPUHP_AP_ONLINE之后状态上回调函数的出错返回前一个状态的行为；

所有注册状态列举在 "/sys/devices/system/cpu/hotplug/states" 中;
 $ tail /sys/devices/system/cpu/hotplug/states
 138: mm/vmscan:online
 139: mm/vmstat:online
 140: lib/percpu_cnt:online
 141: acpi/cpu-drv:online
 142: base/cacheinfo:online
 143: virtio/net:online
 144: x86/mce:online
 145: printk:online
 168: sched:active
 169: online

将CPU4回滚到 140 lib/percpu_cnt:online然后返回online：
  $ cat /sys/devices/system/cpu/cpu4/hotplug/state
  169
  $ echo 140 > /sys/devices/system/cpu/cpu4/hotplug/target
  $ cat /sys/devices/system/cpu/cpu4/hotplug/state
  140
此时，140状态的teardown也调用了；然后，返回：
  $ echo 169 > /sys/devices/system/cpu/cpu4/hotplug/target
  $ cat /sys/devices/system/cpu/cpu4/hotplug/state
  169

当使能跟踪事件时，可看到单个步骤：
#+begin_example
  #  TASK-PID   CPU#    TIMESTAMP  FUNCTION
  #     | |       |        |         |
      bash-394  [001]  22.976: cpuhp_enter: cpu: 0004 target: 140 step: 169 (cpuhp_kick_ap_work)
   cpuhp/4-31   [004]  22.977: cpuhp_enter: cpu: 0004 target: 140 step: 168 (sched_cpu_deactivate)
   cpuhp/4-31   [004]  22.990: cpuhp_exit:  cpu: 0004  state: 168 step: 168 ret: 0
   cpuhp/4-31   [004]  22.991: cpuhp_enter: cpu: 0004 target: 140 step: 144 (mce_cpu_pre_down)
   cpuhp/4-31   [004]  22.992: cpuhp_exit:  cpu: 0004  state: 144 step: 144 ret: 0
   cpuhp/4-31   [004]  22.993: cpuhp_multi_enter: cpu: 0004 target: 140 step: 143 (virtnet_cpu_down_prep)
   cpuhp/4-31   [004]  22.994: cpuhp_exit:  cpu: 0004  state: 143 step: 143 ret: 0
   cpuhp/4-31   [004]  22.995: cpuhp_enter: cpu: 0004 target: 140 step: 142 (cacheinfo_cpu_pre_down)
   cpuhp/4-31   [004]  22.996: cpuhp_exit:  cpu: 0004  state: 142 step: 142 ret: 0
      bash-394  [001]  22.997: cpuhp_exit:  cpu: 0004  state: 140 step: 169 ret: 0
      bash-394  [005]  95.540: cpuhp_enter: cpu: 0004 target: 169 step: 140 (cpuhp_kick_ap_work)
   cpuhp/4-31   [004]  95.541: cpuhp_enter: cpu: 0004 target: 169 step: 141 (acpi_soft_cpu_online)
   cpuhp/4-31   [004]  95.542: cpuhp_exit:  cpu: 0004  state: 141 step: 141 ret: 0
   cpuhp/4-31   [004]  95.543: cpuhp_enter: cpu: 0004 target: 169 step: 142 (cacheinfo_cpu_online)
   cpuhp/4-31   [004]  95.544: cpuhp_exit:  cpu: 0004  state: 142 step: 142 ret: 0
   cpuhp/4-31   [004]  95.545: cpuhp_multi_enter: cpu: 0004 target: 169 step: 143 (virtnet_cpu_online)
   cpuhp/4-31   [004]  95.546: cpuhp_exit:  cpu: 0004  state: 143 step: 143 ret: 0
   cpuhp/4-31   [004]  95.547: cpuhp_enter: cpu: 0004 target: 169 step: 144 (mce_cpu_online)
   cpuhp/4-31   [004]  95.548: cpuhp_exit:  cpu: 0004  state: 144 step: 144 ret: 0
   cpuhp/4-31   [004]  95.549: cpuhp_enter: cpu: 0004 target: 169 step: 145 (console_cpu_notify)
   cpuhp/4-31   [004]  95.550: cpuhp_exit:  cpu: 0004  state: 145 step: 145 ret: 0
   cpuhp/4-31   [004]  95.551: cpuhp_enter: cpu: 0004 target: 169 step: 168 (sched_cpu_activate)
   cpuhp/4-31   [004]  95.552: cpuhp_exit:  cpu: 0004  state: 168 step: 168 ret: 0
      bash-394  [005]  95.553: cpuhp_exit:  cpu: 0004  state: 169 step: 140 ret: 0

#+end_example
As it be seen, CPU4 went down until timestamp 22.996 and then back up until 95.552. All invoked callbacks including their return codes are visible in the trace.
** Architecture's requirements
Following functions and configurations are required:
- ==CONFIG_HOTPLUG_CPU== This entry needs to be enabled in Kconfig
- ==__cpu_up()== Arch interface to bring up a CPU
- ==__cpu_disable()== Arch interface to shutdown a CPU, no more interrupts can be handled by the kernel after the routine returns. This includes the shutdown of the timer.
- ==__cpu_die()== This actually supposed to ensure death of the CPU. Actually look at some example code in other arch that implement CPU hotplug. The processor is taken down from the "idle()" loop for that specific architecure. "__cpu_die()" typically waits for some per_cpu state to be set, to ensure the processor dead rontine is called to be sure positively.
** User Space Notification
CPU成功online/offline后，udev事件发送(样例)：
SUBSYSTEM=="cpu", DRIVERS=="processor", DEVPATH=="/devices/system/cpu/*", RUN+="the_hotplug_receiver.sh"
将会收到所有事件，一个脚本可以进一步处理：
#+begin_src sh
  #!/bin/sh

  if [ "${ACTION}" = "offline" ]
  then
      echo "CPU ${DEVPATH##*/} offline"

  elif [ "${ACTION}" = "online" ]
  then
      echo "CPU ${DEVPATH##*/} online"

  fi
#+end_src
