2023-9-8/489ffd4a40-STDY.html

<li><a id="org1e0ca1e"></a>Examples<br>
<div class="outline-text-4" id="text-1-2-7">
<p>
在STARTING section静态分配并设置startup/teardown函数，以便在online/offline操作时得到通知:
</p>
<div class="org-src-container">
<pre class="src src-c">  ret = cpuhp_setup_state(CPUHP_SUBSYS_STARTING, <span style="font-style: italic;">"subsys:starting"</span>, subsys_cpu_starting, subsys_cpu_dying);
  <span style="font-weight: bold;">if</span>(ret &lt; 0)
        <span style="font-weight: bold;">return</span> ret;
  ...;
  <span style="font-weight: bold;">cpuhp_remove_state</span>(CPUHP_SUBSYS_STARTING);
</pre>
</div>

<p>
动态分配并只在offline操作时调用：
</p>
<div class="org-src-container">
<pre class="src src-c">  state = cpuhp_setup_state(CPUHP_ONLINE_DYN, <span style="font-style: italic;">"subsys:offline"</span>, <span style="font-weight: bold; text-decoration: underline;">NULL</span>, subsys_cpu_offline);
  <span style="font-weight: bold;">if</span>(state &lt; 0)
        <span style="font-weight: bold;">return</span> state;
  ...;
  <span style="font-weight: bold;">cpuhp_remove_state</span>(state);
</pre>
</div>

<p>
ONLINE section + callback on online operations + without invoking:
</p>
<div class="org-src-container">
<pre class="src src-c">  state = cpuhp_setup_state_nocalls(CPUHP_ONLINE_DYN, <span style="font-style: italic;">"subsys:online"</span>, subsys_cpu_online, <span style="font-weight: bold; text-decoration: underline;">NULL</span>);
  <span style="font-weight: bold;">if</span>(state &lt; 0)
        <span style="font-weight: bold;">return</span> state;
  ...;
  <span style="font-weight: bold;">cpuhp_remove_state_nocalls</span>(state);
</pre>
</div>

<p>
ONLINE section + callback on online/offline operations + multi-instances:
</p>
<div class="org-src-container">
<pre class="src src-c">  state = cpuhp_setup_state_multi(CPUHP_ONLINE_DYN, <span style="font-style: italic;">"subsys:online"</span>, subsys_cpu_online, subsys_cpu_offline); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">no callbacks</span>
  <span style="font-weight: bold;">if</span>(state &lt; 0)
        <span style="font-weight: bold;">return</span> state;
  ...;
  ret = cpuhp_setup_add_instance(state, &amp;inst1-&gt;node); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">callback</span>
  <span style="font-weight: bold;">if</span>(ret)
        <span style="font-weight: bold;">return</span> ret;
  ...;
  ret = cpuhp_setup_add_instance(state, &amp;inst2-&gt;node); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">callback</span>
  <span style="font-weight: bold;">if</span>(ret)
        <span style="font-weight: bold;">return</span> ret;
  ...;
  <span style="font-weight: bold;">cpuhp_remove_instance</span>(state, &amp;inst1-&gt;node); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">callback</span>
  ...;
  <span style="font-weight: bold;">cpuhp_remove_instance</span>(state, &amp;inst2-&gt;node); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">callback</span>
  ...;
  <span style="font-weight: bold;">cpuhp_remove_multi_state</span>(state);
</pre>
</div>
</div>
</li>
<li><a id="orgccba6a7"></a>Testing of hotplug states<br>
<div class="outline-text-4" id="text-1-2-8">
<p>
验证一个自定义状态是否工作的一个方法是关闭一个核并重新打开，或者将核置到某个状态，如CPUHP_AP_ONLINE，然后返回到CPUHP_ONLINE; 后者可以模拟CPUHP_AP_ONLINE之后状态上回调函数的出错返回前一个状态的行为；
</p>

<p>
所有注册状态列举在 "/sys/devices/system/cpu/hotplug/states" 中;
 $ tail /sys/devices/system/cpu/hotplug/states
 138: mm/vmscan:online
 139: mm/vmstat:online
 140: lib/percpu_cnt:online
 141: acpi/cpu-drv:online
 142: base/cacheinfo:online
 143: virtio/net:online
 144: x86/mce:online
 145: printk:online
 168: sched:active
 169: online
</p>

<p>
将CPU4回滚到 140 lib/percpu_cnt:online然后返回online：
  $ cat /sys/devices/system/cpu/cpu4/hotplug/state
  169
  $ echo 140 &gt; /sys/devices/system/cpu/cpu4/hotplug/target
  $ cat /sys/devices/system/cpu/cpu4/hotplug/state
  140
此时，140状态的teardown也调用了；然后，返回：
  $ echo 169 &gt; /sys/devices/system/cpu/cpu4/hotplug/target
  $ cat /sys/devices/system/cpu/cpu4/hotplug/state
  169
</p>

<p>
当使能跟踪事件时，可看到单个步骤：
</p>
<pre class="example" id="orge9c76bf">
  #  TASK-PID   CPU#    TIMESTAMP  FUNCTION
  #     | |       |        |         |
      bash-394  [001]  22.976: cpuhp_enter: cpu: 0004 target: 140 step: 169 (cpuhp_kick_ap_work)
   cpuhp/4-31   [004]  22.977: cpuhp_enter: cpu: 0004 target: 140 step: 168 (sched_cpu_deactivate)
   cpuhp/4-31   [004]  22.990: cpuhp_exit:  cpu: 0004  state: 168 step: 168 ret: 0
   cpuhp/4-31   [004]  22.991: cpuhp_enter: cpu: 0004 target: 140 step: 144 (mce_cpu_pre_down)
   cpuhp/4-31   [004]  22.992: cpuhp_exit:  cpu: 0004  state: 144 step: 144 ret: 0
   cpuhp/4-31   [004]  22.993: cpuhp_multi_enter: cpu: 0004 target: 140 step: 143 (virtnet_cpu_down_prep)
   cpuhp/4-31   [004]  22.994: cpuhp_exit:  cpu: 0004  state: 143 step: 143 ret: 0
   cpuhp/4-31   [004]  22.995: cpuhp_enter: cpu: 0004 target: 140 step: 142 (cacheinfo_cpu_pre_down)
   cpuhp/4-31   [004]  22.996: cpuhp_exit:  cpu: 0004  state: 142 step: 142 ret: 0
      bash-394  [001]  22.997: cpuhp_exit:  cpu: 0004  state: 140 step: 169 ret: 0
      bash-394  [005]  95.540: cpuhp_enter: cpu: 0004 target: 169 step: 140 (cpuhp_kick_ap_work)
   cpuhp/4-31   [004]  95.541: cpuhp_enter: cpu: 0004 target: 169 step: 141 (acpi_soft_cpu_online)
   cpuhp/4-31   [004]  95.542: cpuhp_exit:  cpu: 0004  state: 141 step: 141 ret: 0
   cpuhp/4-31   [004]  95.543: cpuhp_enter: cpu: 0004 target: 169 step: 142 (cacheinfo_cpu_online)
   cpuhp/4-31   [004]  95.544: cpuhp_exit:  cpu: 0004  state: 142 step: 142 ret: 0
   cpuhp/4-31   [004]  95.545: cpuhp_multi_enter: cpu: 0004 target: 169 step: 143 (virtnet_cpu_online)
   cpuhp/4-31   [004]  95.546: cpuhp_exit:  cpu: 0004  state: 143 step: 143 ret: 0
   cpuhp/4-31   [004]  95.547: cpuhp_enter: cpu: 0004 target: 169 step: 144 (mce_cpu_online)
   cpuhp/4-31   [004]  95.548: cpuhp_exit:  cpu: 0004  state: 144 step: 144 ret: 0
   cpuhp/4-31   [004]  95.549: cpuhp_enter: cpu: 0004 target: 169 step: 145 (console_cpu_notify)
   cpuhp/4-31   [004]  95.550: cpuhp_exit:  cpu: 0004  state: 145 step: 145 ret: 0
   cpuhp/4-31   [004]  95.551: cpuhp_enter: cpu: 0004 target: 169 step: 168 (sched_cpu_activate)
   cpuhp/4-31   [004]  95.552: cpuhp_exit:  cpu: 0004  state: 168 step: 168 ret: 0
      bash-394  [005]  95.553: cpuhp_exit:  cpu: 0004  state: 169 step: 140 ret: 0

</pre>
<p>
As it be seen, CPU4 went down until timestamp 22.996 and then back up until 95.552. All invoked callbacks including their return codes are visible in the trace.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org9ecd4fc" class="outline-3">
<h3 id="org9ecd4fc"><span class="section-number-3">1.3.</span> Architecture's requirements</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Following functions and configurations are required:
</p>
<ul class="org-ul">
<li><code>=CONFIG_HOTPLUG_CPU=</code> This entry needs to be enabled in Kconfig</li>
<li><code>=__cpu_up()=</code> Arch interface to bring up a CPU</li>
<li><code>=__cpu_disable()=</code> Arch interface to shutdown a CPU, no more interrupts can be handled by the kernel after the routine returns. This includes the shutdown of the timer.</li>
<li><code>=__cpu_die()=</code> This actually supposed to ensure death of the CPU. Actually look at some example code in other arch that implement CPU hotplug. The processor is taken down from the "idle()" loop for that specific architecure. "__cpu_die()" typically waits for some per_cpu state to be set, to ensure the processor dead rontine is called to be sure positively.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc817fec" class="outline-3">
<h3 id="orgc817fec"><span class="section-number-3">1.4.</span> User Space Notification</h3>
<div class="outline-text-3" id="text-1-4">
<p>
CPU成功online/offline后，udev事件发送(样例)：
SUBSYSTEM=="cpu", DRIVERS=="processor", DEVPATH=="/devices/system/cpu/*", RUN+="the_hotplug_receiver.sh"
将会收到所有事件，一个脚本可以进一步处理：
</p>
<div class="org-src-container">
<pre class="src src-sh">  <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/sh</span>

  <span style="font-weight: bold;">if</span> [ <span style="font-style: italic;">"${ACTION}"</span> = <span style="font-style: italic;">"offline"</span> ]
  <span style="font-weight: bold;">then</span>
      <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"CPU ${DEVPATH##*/} offline"</span>

  <span style="font-weight: bold;">elif</span> [ <span style="font-style: italic;">"${ACTION}"</span> = <span style="font-style: italic;">"online"</span> ]
  <span style="font-weight: bold;">then</span>
      <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"CPU ${DEVPATH##*/} online"</span>

  <span style="font-weight: bold;">fi</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 17:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
